x = [-2.000000 -1.900000 -1.800000 -1.700000 -1.600000 -1.500000 -1.400000 -1.300000 -1.200000 -1.100000 -1.000000 -0.900000 -0.800000 -0.700000 -0.600000 -0.500000 -0.400000 -0.300000 -0.200000 -0.100000 0.000000 0.100000 0.200000 0.300000 0.400000 0.500000 0.600000 0.700000 0.800000 0.900000 1.000000 1.100000 1.200000 1.300000 1.400000 1.500000 1.600000 1.700000 1.800000 1.900000 2.000000];
y = [-0.036478 -0.300231 -0.665227 -0.448739 0.572629 0.415652 -2.928039 2.710479 -2.864644 3.305898 -3.225060 -1.950364 -4.409246 -4.302238 -5.498972 -7.791506 -4.601402 -4.015633 -4.410198 -3.499420 0.223196 3.270602 7.536747 13.635946 19.478865 24.806730 24.817750 25.305840 21.828090 16.229010 5.844848 -6.852843 -20.597440 -34.986570 -49.198010 -57.770910 -64.804890 -65.408150 -62.758860 -40.126840 -24.723520];

figure
hold on; grid on
    scatter(x,y,'o');
    % Полином 1-ой степени
    modelfun = @(a,X)(sin(a(1).*X) + a(2)).*(a(3) + a(4).*X);
    beta0 = ones(4);
    beta = nlinfit(x,y, modelfun, beta0);
    plot(x, modelfun(beta,x))
    % Полином 3-ой степени
    modelfun = @(a,X)(sin(a(1).*X) + a(2)).*(a(3) + a(4).*X + a(5).*X.^2+a(6).*X.^3);
    beta0 = ones(6);
    beta = nlinfit(x,y, modelfun, beta0);
    plot(x, modelfun(beta,x))
    % Полином 5-ой степени
    modelfun = @(a,X)(sin(a(1).*X) + a(2)).*(a(3) + a(4).*X + a(5).*X.^2+a(6).*X.^3 + a(7).*X.^4 + a(8).*X.^5);
    beta0 = ones(8);
    beta = nlinfit(x,y, modelfun, beta0);
    plot(x, modelfun(beta,x))
    % Полином 7-ой степени
    modelfun = @(a,X)(sin(a(1).*X) + a(2)).*(a(3) + a(4).*X + a(5).*X.^2+a(6).*X.^3 + a(7).*X.^4 + a(8).*X.^5 + a(9).*X.^6 + a(10).*X.^7);
    beta0 = ones(10);
    beta = nlinfit(x,y, modelfun, beta0);
    plot(x, modelfun(beta,x))
    % Полином 9-ой степени
    modelfun = @(a,X)(sin(a(1).*X) + a(2)).*(a(3) + a(4).*X + a(5).*X.^2+a(6).*X.^3 + a(7).*X.^4 + a(8).*X.^5 + a(9).*X.^6 + a(10).*X.^7 + a(11).*X.^8 + a(12).*X.^9);
    beta0 = ones(13);
    beta = nlinfit(x,y, modelfun, beta0);
    plot(x, modelfun(beta,x))
    legend("Исходные точки","Полином 1-ой степени","Полином 3-ей степени","Полином 5-ой степени","Полином 7-ой степени", "Полином 9-ой степени")
hold off

figure
hold on; grid on
    scatter(x,y,'o');
    % Полином 11-ой степени
    modelfun = @(a,X)(sin(a(1).*X) + a(2)).*(a(3) + a(4).*X + a(5).*X.^2+a(6).*X.^3 + a(7).*X.^4 + a(8).*X.^5 + a(9).*X.^6 + a(10).*X.^7 + a(11).*X.^8 + a(12).*X.^9 + a(13).*X.^10 + a(14).*X.^11);
    beta0 = ones(14);
    beta = nlinfit(x,y, modelfun, beta0);
    plot(x, modelfun(beta,x))
    % Полином 20-ой степени
    modelfun = @(a,X)(sin(a(1).*X) + a(2)).*(a(3) + a(4).*X + a(5).*X.^2+a(6).*X.^3 + a(7).*X.^4 + a(8).*X.^5 + a(9).*X.^6 + a(10).*X.^7 + a(11).*X.^8 + a(12).*X.^9 + a(13).*X.^10 + a(14).*X.^11 + a(15).*X.^12 + a(16).*X.^13 + a(17).*X.^14 + a(18).*X.^15 + a(19).*X.^16 + a(20).*X.^17 + a(21).*X.^18 + a(22).*X.^19 + a(23).*X.^20);
    beta0 = ones(23);
    beta = nlinfit(x,y, modelfun, beta0);
    plot(x, modelfun(beta,x), 'k--')
    legend("Исходные точки", "Полином 11-ой степени", "Полином 20-ой степени")
hold off
