% https://www.macalester.edu/~kaplan/Resampling/PDF/regress.pdf
x = [-2.000000 -1.900000 -1.800000 -1.700000 -1.600000 -1.500000 -1.400000 -1.300000 -1.200000 -1.100000 -1.000000 -0.900000 -0.800000 -0.700000 -0.600000 -0.500000 -0.400000 -0.300000 -0.200000 -0.100000 0.000000 0.100000 0.200000 0.300000 0.400000 0.500000 0.600000 0.700000 0.800000 0.900000 1.000000 1.100000 1.200000 1.300000 1.400000 1.500000 1.600000 1.700000 1.800000 1.900000 2.000000];
y = [-0.036478 -0.300231 -0.665227 -0.448739 0.572629 0.415652 -2.928039 2.710479 -2.864644 3.305898 -3.225060 -1.950364 -4.409246 -4.302238 -5.498972 -7.791506 -4.601402 -4.015633 -4.410198 -3.499420 0.223196 3.270602 7.536747 13.635946 19.478865 24.806730 24.817750 25.305840 21.828090 16.229010 5.844848 -6.852843 -20.597440 -34.986570 -49.198010 -57.770910 -64.804890 -65.408150 -62.758860 -40.126840 -24.723520];

hold on
    % Исходные точки
    scatter(x,y,'filled'); grid on;
    % Полиномиальная 1
    p = polyfit(x', y', 1);
    y1 = polyval(p, x);
    plot(x, y1, 'b--', 'LineWidth', 1);
    % Полиномиальная 5
    p = polyfit(x', y', 5);
    y1 = polyval(p, x);
    plot(x, y1, 'r--', 'LineWidth', 1);
    % Полиномиальная 9
    p = polyfit(x', y', 9);
    y1 = polyval(p, x);
    plot(x, y1, 'g--', 'LineWidth', 1);
    % Полиномиальная 16
    p = polyfit(x', y', 16);
    y1 = polyval(p, x);
    plot(x, y1, 'c--', 'LineWidth', 1);
    % Полиномиальная 25
    p = polyfit(x', y', 25);
    y1 = polyval(p, x);
    plot(x, y1, 'm--', 'LineWidth', 1);
    % Полиномиальная 30
    p = polyfit(x', y', 30);
    y1 = polyval(p, x);
    plot(x, y1, 'k--', 'LineWidth', 1);
    legend("Исходная", "Полином 1 степени", "Полином 5 степени", "Полином 9 степени", "Полином 16 степени", "Полином 25 степени", "Полином 30 степени")
hold off